reports/333-reason.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.840ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.844ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.844ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    0.96ms  14.34ms   72.85%
    Req/Sec     3.52k   412.43     7.89k    73.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    2.38ms
 90.000%    3.11ms
 99.000%    4.71ms
 99.900%    6.59ms
 99.990%   12.49ms
 99.999%   13.62ms
100.000%   14.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.221     0.000000            1         1.00
       0.840     0.100000        49498         1.11
       1.065     0.200000        99043         1.25
       1.262     0.300000       148332         1.43
       1.460     0.400000       197884         1.67
       1.675     0.500000       247405         2.00
       1.792     0.550000       272084         2.22
       1.919     0.600000       296655         2.50
       2.057     0.650000       321398         2.86
       2.209     0.700000       346174         3.33
       2.381     0.750000       371051         4.00
       2.473     0.775000       383375         4.44
       2.569     0.800000       395654         5.00
       2.677     0.825000       407921         5.71
       2.797     0.850000       420306         6.67
       2.937     0.875000       432602         8.00
       3.019     0.887500       438900         8.89
       3.107     0.900000       445044        10.00
       3.207     0.912500       451174        11.43
       3.329     0.925000       457380        13.33
       3.469     0.937500       463507        16.00
       3.549     0.943750       466604        17.78
       3.637     0.950000       469695        20.00
       3.733     0.956250       472814        22.86
       3.845     0.962500       475909        26.67
       3.973     0.968750       478983        32.00
       4.045     0.971875       480501        35.56
       4.127     0.975000       482106        40.00
       4.215     0.978125       483592        45.71
       4.311     0.981250       485176        53.33
       4.435     0.984375       486716        64.00
       4.503     0.985938       487472        71.11
       4.575     0.987500       488227        80.00
       4.659     0.989062       489009        91.43
       4.755     0.990625       489794       106.67
       4.859     0.992188       490550       128.00
       4.931     0.992969       490927       142.22
       4.999     0.993750       491323       160.00
       5.087     0.994531       491701       182.86
       5.179     0.995313       492089       213.33
       5.295     0.996094       492469       256.00
       5.371     0.996484       492668       284.44
       5.451     0.996875       492855       320.00
       5.527     0.997266       493048       365.71
       5.631     0.997656       493241       426.67
       5.791     0.998047       493435       512.00
       5.891     0.998242       493531       568.89
       6.015     0.998437       493629       640.00
       6.143     0.998633       493726       731.43
       6.307     0.998828       493822       853.33
       6.647     0.999023       493918      1024.00
       7.051     0.999121       493965      1137.78
       7.707     0.999219       494014      1280.00
       8.591     0.999316       494063      1462.86
       9.351     0.999414       494110      1706.67
      10.015     0.999512       494159      2048.00
      10.311     0.999561       494182      2275.56
      10.751     0.999609       494206      2560.00
      10.951     0.999658       494232      2925.71
      11.191     0.999707       494255      3413.33
      11.615     0.999756       494279      4096.00
      11.767     0.999780       494291      4551.11
      11.879     0.999805       494304      5120.00
      12.087     0.999829       494317      5851.43
      12.151     0.999854       494328      6826.67
      12.343     0.999878       494340      8192.00
      12.423     0.999890       494345      9102.22
      12.495     0.999902       494353     10240.00
      12.679     0.999915       494358     11702.86
      12.719     0.999927       494364     13653.33
      12.903     0.999939       494369     16384.00
      12.951     0.999945       494372     18204.44
      12.975     0.999951       494376     20480.00
      13.015     0.999957       494378     23405.71
      13.071     0.999963       494381     27306.67
      13.119     0.999969       494384     32768.00
      13.287     0.999973       494386     36408.89
      13.295     0.999976       494387     40960.00
      13.487     0.999979       494389     46811.43
      13.519     0.999982       494390     54613.33
      13.591     0.999985       494392     65536.00
      13.623     0.999986       494395     72817.78
      13.623     0.999988       494395     81920.00
      13.623     0.999989       494395     93622.86
      13.623     0.999991       494395    109226.67
      13.687     0.999992       494396    131072.00
      13.687     0.999993       494396    145635.56
      13.687     0.999994       494396    163840.00
      13.703     0.999995       494397    187245.71
      13.703     0.999995       494397    218453.33
      13.719     0.999996       494398    262144.00
      13.719     0.999997       494398    291271.11
      13.719     0.999997       494398    327680.00
      13.719     0.999997       494398    374491.43
      13.719     0.999998       494398    436906.67
      14.351     0.999998       494399    524288.00
      14.351     1.000000       494399          inf
#[Mean    =        1.861, StdDeviation   =        0.956]
#[Max     =       14.344, Total count    =       494399]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597340 requests in 1.00m, 22.79MB read
Requests/sec:   9955.61
Transfer/sec:    388.89KB