reports/333-reason.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.840ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.830ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.828ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.87ms    0.96ms  16.04ms   72.52%
    Req/Sec     3.52k   421.84     7.00k    74.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.68ms
 75.000%    2.40ms
 90.000%    3.14ms
 99.000%    4.78ms
 99.900%    6.36ms
 99.990%   12.18ms
 99.999%   13.84ms
100.000%   16.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.232     0.000000            1         1.00
       0.848     0.100000        49601         1.11
       1.070     0.200000        99098         1.25
       1.264     0.300000       148482         1.43
       1.459     0.400000       197910         1.67
       1.676     0.500000       247271         2.00
       1.797     0.550000       272017         2.22
       1.927     0.600000       296642         2.50
       2.071     0.650000       321593         2.86
       2.227     0.700000       346117         3.33
       2.403     0.750000       370833         4.00
       2.499     0.775000       383386         4.44
       2.599     0.800000       395612         5.00
       2.707     0.825000       407984         5.71
       2.829     0.850000       420346         6.67
       2.971     0.875000       432635         8.00
       3.051     0.887500       438869         8.89
       3.139     0.900000       445066        10.00
       3.237     0.912500       451128        11.43
       3.353     0.925000       457341        13.33
       3.493     0.937500       463499        16.00
       3.573     0.943750       466618        17.78
       3.659     0.950000       469723        20.00
       3.753     0.956250       472759        22.86
       3.863     0.962500       475842        26.67
       3.995     0.968750       478933        32.00
       4.073     0.971875       480476        35.56
       4.159     0.975000       482034        40.00
       4.251     0.978125       483577        45.71
       4.363     0.981250       485143        53.33
       4.487     0.984375       486687        64.00
       4.555     0.985938       487448        71.11
       4.635     0.987500       488221        80.00
       4.723     0.989062       489000        91.43
       4.823     0.990625       489752       106.67
       4.939     0.992188       490515       128.00
       5.011     0.992969       490926       142.22
       5.087     0.993750       491306       160.00
       5.167     0.994531       491690       182.86
       5.263     0.995313       492069       213.33
       5.363     0.996094       492456       256.00
       5.423     0.996484       492645       284.44
       5.491     0.996875       492837       320.00
       5.571     0.997266       493029       365.71
       5.671     0.997656       493229       426.67
       5.791     0.998047       493418       512.00
       5.859     0.998242       493508       568.89
       5.939     0.998437       493609       640.00
       6.051     0.998633       493703       731.43
       6.203     0.998828       493803       853.33
       6.383     0.999023       493895      1024.00
       6.511     0.999121       493946      1137.78
       6.723     0.999219       493991      1280.00
       7.155     0.999316       494040      1462.86
       8.135     0.999414       494088      1706.67
       9.231     0.999512       494136      2048.00
       9.551     0.999561       494160      2275.56
       9.935     0.999609       494185      2560.00
      10.239     0.999658       494209      2925.71
      10.567     0.999707       494235      3413.33
      10.887     0.999756       494257      4096.00
      10.983     0.999780       494270      4551.11
      11.135     0.999805       494282      5120.00
      11.375     0.999829       494294      5851.43
      11.575     0.999854       494305      6826.67
      11.863     0.999878       494317      8192.00
      12.071     0.999890       494323      9102.22
      12.287     0.999902       494329     10240.00
      12.423     0.999915       494336     11702.86
      12.591     0.999927       494341     13653.33
      12.695     0.999939       494347     16384.00
      13.087     0.999945       494352     18204.44
      13.103     0.999951       494353     20480.00
      13.135     0.999957       494356     23405.71
      13.287     0.999963       494359     27306.67
      13.335     0.999969       494362     32768.00
      13.351     0.999973       494364     36408.89
      13.383     0.999976       494365     40960.00
      13.391     0.999979       494367     46811.43
      13.399     0.999982       494368     54613.33
      13.687     0.999985       494371     65536.00
      13.687     0.999986       494371     72817.78
      13.687     0.999988       494371     81920.00
      13.839     0.999989       494372     93622.86
      14.239     0.999991       494373    109226.67
      14.439     0.999992       494374    131072.00
      14.439     0.999993       494374    145635.56
      14.439     0.999994       494374    163840.00
      14.455     0.999995       494375    187245.71
      14.455     0.999995       494375    218453.33
      14.519     0.999996       494376    262144.00
      14.519     0.999997       494376    291271.11
      14.519     0.999997       494376    327680.00
      14.519     0.999997       494376    374491.43
      14.519     0.999998       494376    436906.67
      16.047     0.999998       494377    524288.00
      16.047     1.000000       494377          inf
#[Mean    =        1.872, StdDeviation   =        0.960]
#[Max     =       16.040, Total count    =       494377]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597325 requests in 1.00m, 22.79MB read
Requests/sec:   9955.29
Transfer/sec:    388.88KB